let allData = {
    head: ["姓名", "学院/专业", "状态", "联系方式"],
    data: {
        2023: [
            ["张晓宇", "电子信息", "在役", ""],
            ["任志豪", "计算机/网工", "在役", ""],
            ["申悦祺", "计算机/软工", "在役", ""],
            ["齐豪", "计算机/计科", "在役", ""],
            ["王军超", "计算机/软工", "在役", ""],
        ],
        2022: [
            ["赵志豪（队长）", "计算机/计科", "在役", ""],
            ["李根", "计算机/计科", "在役", ""],
            ["贾捷夫", "计算机/计科", "在役", ""],
            ["毛鹏飞", "计算机/计科", "在役", ""],
            ["许丰", "计算机/软工", "在役", ""],
            ["陈秦川", "计算机/人工智能", "在役", ""],
            ["方奕凯", "计算机/人工智能", "在役", ""],
            ["周宏凯", "计算机/人工智能", "在役", ""]
        ],
        2021: [
            ["许田丰（队长）", "计算机/计科", "在役", ""],
            ["孙承鑫", "计算机/软工", "退役", ""],
            ["崔洪源", "计算机/网工", "在役", ""],
            ["关宏昌", "计算机/计科", "退役", ""],
            ["刘德仕", "计算机/计科", "退役", ""],
            ["牛广原", "计算机/物联网", "退役", ""]
        ],
        2020: [
            ["王淑骁（队长）", "智工", "退役", ""],
            ["陈馨怡", "智工", "退役", ""],
            ["成勇昊", "智工", "退役", ""],
            ["程成", "智工", "退役", ""],
            ["丁续兵", "智工", "退役", ""],
            ["丁元昊", "智工", "退役", ""],
            ["豆晨曦", "智工", "退役", ""],
            ["范坤", "智工", "退役", ""],
            ["耿金贤", "智工", "退役", ""],
            ["郭涵", "智工", "退役", ""],
            ["韩俊涛", "智工", "退役", ""],
            ["胡辉", "智工", "退役", ""],
            ["黄承轩", "智工", "退役", ""],
            ["黄韵滋", "智工", "退役", ""],
            ["金胜凯", "智工", "退役", ""],
            ["靳梦欣", "智工", "退役", ""],
            ["李慧华", "智工", "退役", ""],
            ["李旭鹏", "智工", "退役", ""],
            ["李政志", "智工", "退役", ""],
            ["林本龙", "智工", "退役", ""],
            ["刘博宇", "智工", "退役", ""],
            ["刘丁铭", "智工", "退役", ""],
            ["刘文浩", "智工", "退役", ""],
            ["刘潇", "智工", "退役", ""],
            ["刘宇航", "智工", "退役", ""],
            ["吕留冰", "智工", "退役", ""],
            ["吕明麾", "智工", "退役", ""],
            ["申佳鑫", "智工", "退役", ""],
            ["石磊", "智工", "退役", ""],
            ["田振杰", "智工", "退役", ""],
            ["铁展仪", "智工", "退役", ""],
            ["王晗", "智工", "退役", ""],
            ["王和川", "智工", "退役", ""],
            ["王磊", "智工", "退役", ""],
            ["王胜洋", "智工", "退役", ""],
            ["王雯", "智工", "退役", ""],
            ["王鑫", "智工", "退役", ""],
            ["王智豪", "智工", "退役", ""],
            ["王子璋", "智工", "退役", ""],
            ["魏恩华", "智工", "退役", ""],
            ["辛蒙然", "智工", "退役", ""],
            ["杨博涵", "智工", "退役", ""],
            ["张峰", "智工", "退役", ""],
            ["张静", "智工", "退役", ""],
            ["张一飞", "智工", "退役", ""],
            ["张钊", "智工", "退役", ""],
            ["张子浩", "智工", "退役", ""],
            ["赵江澎", "智工", "退役", ""],
            ["赵祥霖", "智工", "退役", ""],
            ["郑江涛", "智工", "退役", ""]
        ],
        2019: [
            ["逯绵硕（队长）", "智工", "退役", ""],
            ["李仕优（队长）", "智工", "退役", ""],
            ["曹礼博", "智工", "退役", ""],
            ["陈润文", "智工", "退役", ""],
            ["陈望悠", "智工", "退役", ""],
            ["翟颖", "智工", "退役", ""],
            ["盖嘉诚", "智工", "退役", ""],
            ["郭玉龙", "智工", "退役", ""],
            ["黄庭丰", "智工", "退役", ""],
            ["闫德闯", "智工", "退役", ""],
            ["贾永超", "智工", "退役", ""],
            ["姜怡", "智工", "退役", ""],
            ["金贺玉", "智工", "退役", ""],
            ["李宁", "智工", "退役", ""],
            ["李选", "智工", "退役", ""],
            ["刘明勋", "智工", "退役", ""],
            ["刘欣雨", "智工", "退役", ""],
            ["刘颜恺", "智工", "退役", ""],
            ["鲁彦宏", "智工", "退役", ""],
            ["罗雅文", "智工", "退役", ""],
            ["吕伟涛", "智工", "退役", ""],
            ["马楚然", "智工", "退役", ""],
            ["马锦涛", "智工", "退役", ""],
            ["潘宁超", "智工", "退役", ""],
            ["潘擎宇", "智工", "退役", ""],
            ["庞季璇", "智工", "退役", ""],
            ["彭瑞豪", "智工", "退役", ""],
            ["任璐", "智工", "退役", ""],
            ["王皓辰", "智工", "退役", ""],
            ["王美华", "智工", "退役", ""],
            ["温玉璐", "智工", "退役", ""],
            ["吴源", "智工", "退役", ""],
            ["夏俊", "智工", "退役", ""],
            ["宣海宇", "智工", "退役", ""],
            ["杨光", "智工", "退役", ""],
            ["杨钦元", "智工", "退役", ""],
            ["杨斯然", "智工", "退役", ""],
            ["杨雯迪", "智工", "退役", ""],
            ["于畅", "智工", "退役", ""],
            ["于永川", "智工", "退役", ""],
            ["张浩月", "智工", "退役", ""],
            ["张鹏", "智工", "退役", ""],
            ["张雨佳", "智工", "退役", ""],
            ["赵文赐", "智工", "退役", ""],
            ["周洋洋", "智工", "退役", ""],
            ["朱锋", "智工", "退役", ""]
        ],
        2018: [
            ["苏泉（队长）", "智工", "退役", ""],
            ["牛思琦（队长）", "智工", "退役", ""],
            ["陈思源", "智工", "退役", ""],
            ["陈亚辉", "智工", "退役", ""],
            ["陈泽宇", "智工", "退役", ""],
            ["陈智", "智工", "退役", ""],
            ["崔润梓", "智工", "退役", ""],
            ["郝冰倩", "智工", "退役", ""],
            ["黄要诚", "智工", "退役", ""],
            ["惠占发", "智工", "退役", ""],
            ["解秋寒", "智工", "退役", ""],
            ["李璞", "智工", "退役", ""],
            ["李文志", "智工", "退役", ""],
            ["李稳璐", "智工", "退役", ""],
            ["连玉洁", "智工", "退役", ""],
            ["齐梦允", "智工", "退役", ""],
            ["苏悦壮", "智工", "退役", ""],
            ["王琛", "智工", "退役", ""],
            ["王浩", "智工", "退役", ""],
            ["王浩哲", "智工", "退役", ""],
            ["王琦", "智工", "退役", ""],
            ["谢雨欣", "智工", "退役", ""],
            ["熊涛", "智工", "退役", ""],
            ["徐亮亮", "智工", "退役", ""],
            ["杨剑", "智工", "退役", ""],
            ["杨静妍", "智工", "退役", ""],
            ["杨凯", "智工", "退役", ""],
            ["杨涛", "智工", "退役", ""],
            ["杨雨涵", "智工", "退役", ""],
            ["郁沛", "智工", "退役", ""],
            ["张瑞丹", "智工", "退役", ""],
            ["张智", "智工", "退役", ""]
        ],
        2017: [
            ["张竞原（队长）", "智工", "退役", ""],
            ["暴阳豪", "智工", "退役", ""],
            ["陈思诺", "智工", "退役", ""],
            ["陈莹", "智工", "退役", ""],
            ["程元", "智工", "退役", ""],
            ["崔永灿", "智工", "退役", ""],
            ["董旭辉", "智工", "退役", ""],
            ["高建生", "智工", "退役", ""],
            ["韩传福", "智工", "退役", ""],
            ["韩可美", "智工", "退役", ""],
            ["韩祥", "智工", "退役", ""],
            ["季治良", "智工", "退役", ""],
            ["金闫归", "智工", "退役", ""],
            ["李波", "智工", "退役", ""],
            ["刘坤", "智工", "退役", ""],
            ["庞慧霞", "智工", "退役", ""],
            ["任俊屹", "智工", "退役", ""],
            ["孙开元", "智工", "退役", ""],
            ["吴国睿", "智工", "退役", ""],
            ["吴轩", "智工", "退役", ""],
            ["武永闯", "智工", "退役", ""],
            ["徐正昊", "智工", "退役", ""],
            ["杨礼之", "智工", "退役", ""],
            ["杨旭光", "智工", "退役", ""],
            ["杨勋宇", "智工", "退役", ""],
            ["姚越", "智工", "退役", ""],
            ["张好徽", "智工", "退役", ""],
            ["张浩", "智工", "退役", ""],
            ["周子恒", "智工", "退役", ""]
        ],
        2016: [
            ["王学孟", "智工", "退役", ""]
        ]
    }

};
console.log(allData['head'].map(name => `<td>${name}</td>`).join(''));
let navTabs = document.querySelector(".nav-tabs");
let tabContents = document.querySelector(".tab-contents");
let years = Object.keys(allData['data']).sort((a, b) => b - a);

navTabs.innerHTML = years.map(year => `
    <li class="tab"><button type="button" data-href="#${year}">${year}级</button></li>
`).join('');
tabContents.innerHTML = years.map(year => `
    <div class="tab-item-content ${year == years[0] ? 'active' : ''}" id="${year}">
        <table>
            <thead>
                <tr>
                    ${allData['head'].map(name => `<td>${name}</td>`).join('')}
                </tr>
            </thead>
            <tbody>
                ${allData['data'][year].map(info => `
                    <tr>
                        <td>${info[0]}</td>
                        <td>${info[1]}</td>
                        <td><mark class="hl-label ${info[2] == '在役' ? 'green' : 'default'}">${info[2]}</mark></td>
                        <td>${info[3]}</td>
                    </tr>
                ` ).join('')}
            </tbody>
        </table>
    </div>
`).join('');